docs/_static/data-model/o-ran-smo-teiv-ran-rel.dot
digraph "moduleName" {
node ["shape"="box","fontname"="Arial"]
edge ["color"="darkslategray4","fontname"="Arial"]
"o-ran-smo-teiv-ranAntennaCapability" ["style"="filled","fillcolor"="#366F3441","label"="AntennaCapability"]
"o-ran-smo-teiv-ranNRCellCU" ["style"="filled","fillcolor"="#366F3441","label"="NRCellCU"]
"o-ran-smo-teiv-ranNRCellDU" ["label"="NRCellDU","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranNRSectorCarrier" ["label"="NRSectorCarrier","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranNearRTRICFunction" ["label"="NearRTRICFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUCPFunction" ["label"="OCUCPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranOCUUPFunction" ["label"="OCUUPFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranODUFunction" ["label"="ODUFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranORUFunction" ["label"="ORUFunction","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranSMO" ["style"="filled","fillcolor"="#366F3441","label"="SMO"]
"o-ran-smo-teiv-ranSector" ["label"="Sector","style"="filled","fillcolor"="#366F3441"]
"o-ran-smo-teiv-ranNRCellDU" -> "o-ran-smo-teiv-ranNRSectorCarrier" ["label"="USES","headlabel"="0..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranNRSectorCarrier" -> "o-ran-smo-teiv-ranAntennaCapability" ["label"="USES","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranNearRTRICFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranNRCellCU" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUCPFunction" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="E1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranOCUUPFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNRSectorCarrier" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNRCellDU" ["label"="PROVIDES","headlabel"="1..1","taillabel"="0..*","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranOCUUPFunction" ["label"="F1ULINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranOCUCPFunction" ["label"="F1CLINK","headlabel"="0..1","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranODUFunction" -> "o-ran-smo-teiv-ranNearRTRICFunction" ["label"="E2LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHULINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHSLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="OFHMLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHMLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranODUFunction" ["label"="OFHCLINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranORUFunction" -> "o-ran-smo-teiv-ranSMO" ["label"="O1LINK","headlabel"="0..*","taillabel"="0..1","arrowhead"="vee"]
"o-ran-smo-teiv-ranSector" -> "o-ran-smo-teiv-ranNRCellDU" ["label"="GROUPS","headlabel"="0..1","taillabel"="0..*","arrowhead"="vee"]
}
